#!/usr/bin/python
# -*- coding: utf-8 -*-
#================================================================
#  Copyright (C) 2017 free for learn
#   
#     file:	2.py
#    brief：题目：企业发放的奖金根据利润提成。利润(I)低于或等于10万元时，
#    		奖金可提10%；利润高于10万元，低于20万元时，低于10万元的部分按10%提成，
#    		高于10万元的部分，可可提成7.5%；20万到40万之间时，高于20万元的部分，
#    		可提成5%；40万到60万之间时高于40万元的部分，可提成3%；60万到100万之间时，
#    		高于60万元的部分，可提成1.5%，高于100万元时，超过100万元的部分按1%提成，
#    		从键盘输入当月利润I，求应发放奖金总数？
#  history:	2017-10-10  renbin.guo created
#     note:	
#    usage:	
#
#================================================================

profit = int(input("please input profit:"))
print(profit)
if(profit <= 10):
	print("##10")
	bonus = 0.1*profit
elif(profit<=20):
	print("##20")
	bonus = 10*0.1 + (profit-10)*0.075
elif(profit<=40):
	print("##40")
	bonus = 10*0.1+10*0.075+(profit-20)*0.05
elif profit <= 60:
	print("##60")
	bonus = 10*0.1+10*0.075+20*0.05+(profit-40)*0.03
elif profit<=100:
	print("##100")
	bonus = 10*0.1+10*0.075+20*0.05+20*0.03+(profit-60)*0.015
elif profit>100:
	bonus= 10*0.1+10*0.075+20*0.05+20*0.03+40*0.015+(profit-100)*0.01
print("bonus = %s"%bonus)   ## 注意这里不能使用%d ,否则小数会被取整
